# St7SetBrickLabelStyle

Sets the display style for brick labels.

long St7SetBrickLabelStyle(long uID, long LabelStyle)
Input Parameters
uID
Strand7 model file ID.
LabelStyle
One of lsNone, lsEntityNumber, lsIDNumber, lsPropertyNumber, lsPropertyName or lsPropertyType.
Dependencies
Font
Assigned using St7SetEntityFont.